README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>README</title>
<!-- 2014-07-14 Mon 08:32 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Ander" />
</head>
<body>
<div id="content">
<h1 class="title">README</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Generate Track scaffold</a></li>
<li><a href="#sec-2">2. Install the 'aws-sdk' ruby gem</a></li>
<li><a href="#sec-3">3. Install paperclip</a></li>
<li><a href="#sec-4">4. Setup Devise</a>
<ul>
<li><a href="#sec-4-1">4.1. Install Devise</a></li>
<li><a href="#sec-4-2">4.2. Setup Devise</a></li>
</ul>
</li>
<li><a href="#sec-5">5. Configure tracks model with paperclip</a>
<ul>
<li><a href="#sec-5-1">5.1. Generate a paperclip migration</a></li>
<li><a href="#sec-5-2">5.2. Update the Tracks controller for strong parameters</a></li>
<li><a href="#sec-5-3">5.3. Update Tracks views</a></li>
</ul>
</li>
<li><a href="#sec-6">6. Configure S3</a>
<ul>
<li><a href="#sec-6-1">6.1. Get secret keys from AWS and configure heroku configs</a></li>
</ul>
</li>
<li><a href="#sec-7">7. Set up for audio playback</a></li>
<li><a href="#sec-8">8. User/Track associations</a></li>
<li><a href="#sec-9">9. Set up Bootstrap</a>
<ul>
<li><a href="#sec-9-1">9.1. Bootstrap-sass</a></li>
</ul>
</li>
<li><a href="#sec-10">10. Configure Views</a>
<ul>
<li><a href="#sec-10-1">10.1. Pages / Songs</a></li>
<li><a href="#sec-10-2">10.2. Devise Views</a></li>
<li><a href="#sec-10-3">10.3. Tracks</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Daily Record
<a href="http://daily-record.herokuapp.com">http://daily-record.herokuapp.com</a>
</p>

<p>
Simple use multi-track collaborative music blog
</p>

<p>
Starting off following this <a href="http://code.tutsplus.com/articles/create-a-simple-music-streaming-app-with-ruby-on-rails--net-18437">tutorial</a>. 
It's kind of old, but let's see what we can get out of it anyway. For portions 
that I know are out of date, I am referencing <a href="https://onemonth.com/steps/paperclip-to-amazon-s3-images-on-heroku">onemonthrails</a>.
</p>

<p>
<a href="./FILES.html">Files</a>
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Generate Track scaffold</h2>
<div class="outline-text-2" id="text-1">
<pre class="example">
rails g scaffold tracks author:string title:string reflection:text
rake db:migrate
</pre>
</div>
</div>


<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Install the 'aws-sdk' ruby gem</h2>
<div class="outline-text-2" id="text-2">
<p>
<a href="./Gemfile">Gemfile</a>
</p>

<pre class="example">
gem 'aws-sdk', '~&gt; 1.47.0'
</pre>
</div>
</div>


<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Install paperclip</h2>
<div class="outline-text-2" id="text-3">
<p>
<a href="./Gemfile">Gemfile</a>  
</p>

<pre class="example">
gem 'paperclip', '~&gt; 4.2.0'
</pre>
</div>
</div>


<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Setup Devise</h2>
<div class="outline-text-2" id="text-4">
<p>
<a href="https://github.com/plataformatec/devise">https://github.com/plataformatec/devise</a>
</p>

<p>
<a href="./Gemfile">Gemfile</a>  
</p>
</div>

<div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Install Devise</h3>
<div class="outline-text-3" id="text-4-1">
<pre class="example">
gem 'devise'
bundle install
rails g devise:install
</pre>
</div>
</div>


<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> Setup Devise</h3>
<div class="outline-text-3" id="text-4-2">
<ul class="org-ul">
<li><code>[&#xa0;]</code> Define default url options in environments files

<ul class="org-ul">
<li><code>[&#xa0;]</code> <a href="./config/environments/development.rb">development.rb</a>

<pre class="example">
config.action_mailer.default_url_options = { host: 'localhost:3000' }
</pre>
</li>

<li><code>[&#xa0;]</code> <a href="./config/environments/production.rb">production.rb</a>

<pre class="example">
config.action_mailer.default_url_options = { host: 'http://daily-record.herokuapp.com' }
</pre>
</li>
</ul>
</li>

<li><code>[&#xa0;]</code> Define root<sub>url</sub> to <b>something</b>

<p>
<a href="./config/routes.rb">routes.rb</a>
</p>

<pre class="example">
root to: "tracks#index"
</pre>
</li>

<li><code>[&#xa0;]</code> Place flash messages

<p>
<a href="./app/views/layouts/application.html.erb">application view</a>
</p>

<pre class="example">
&lt;p class="notice"&gt;&lt;%= notice %&gt;&lt;/p&gt;
&lt;p class="alert"&gt;&lt;%= alert %&gt;&lt;/p&gt;
</pre>
</li>

<li><code>[&#xa0;]</code> Generate Devise views

<pre class="example">
rails g devise:views
</pre>
</li>

<li><code>[&#xa0;]</code> Generate Devise User model

<pre class="example">
rails g devise User
rake db:migrate
</pre>
</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Configure tracks model with paperclip</h2>
<div class="outline-text-2" id="text-5">
<p>
<a href="./app/models/track.rb">track.rb</a>
</p>

<pre class="example">
belongs_to :user
has_attached_file :audio
</pre>
</div>

<div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> Generate a paperclip migration</h3>
<div class="outline-text-3" id="text-5-1">
<pre class="example">
rails g paperclip track audio
rake db:migrate
</pre>
</div>
</div>


<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> Update the Tracks controller for strong parameters</h3>
<div class="outline-text-3" id="text-5-2">
<p>
<a href="./app/controllers/tracks_controller.rb">tracks controller</a>
</p>

<pre class="example">
def track_params
  params.require(:track).permit(:author, :title, :reflection, :audio)
end
</pre>

<ul class="org-ul">
<li><code>[&#xa0;]</code> As of version 4.0, all attachments are required to include a 
content<sub>type</sub> validation, a file<sub>name</sub> validation, or to explicitly state 
that they're not going to have either. Paperclip raises 
'MissingRequiredValidatorError' if you do not do this.

<p>
<a href="http://stackoverflow.com/questions/21897725/papercliperrorsmissingrequiredvalidatorerror-with-rails-4">http://stackoverflow.com/questions/21897725/papercliperrorsmissingrequiredvalidatorerror-with-rails-4</a>
</p>

<ul class="org-ul">
<li><code>[&#xa0;]</code> add to <a href="./app/models/track.rb">Track Model</a>

<pre class="example">
validates_attachment_content_type :audio, :content_type =&gt; ['audio/mp3','audio/mpeg','audio/wav']
</pre>
</li>
</ul>
</li>

<li><code>[&#xa0;]</code> WAV type?
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="section-number-3">5.3</span> Update Tracks views</h3>
<div class="outline-text-3" id="text-5-3">
<ul class="org-ul">
<li><code>[&#xa0;]</code> <a href="./app/views/tracks/_form.html.erb">Form</a>

<pre class="example">
&lt;div class="form-group"&gt;
  &lt;%= f.label :audio %&gt;
  &lt;%= f.file_field :audio, class: "form-control" %&gt;
&lt;/div&gt;
</pre>
</li>

<li><code>[&#xa0;]</code> <a href="./app/views/tracks/show.html.erb">Show</a>

<p>
<a href="http://apidock.com/rails/ActionView/Helpers/AssetTagHelper/audio_tag">http://apidock.com/rails/ActionView/Helpers/AssetTagHelper/audio_tag</a>
</p>

<pre class="example">
&lt;p&gt;
  &lt;strong&gt;Audio:&lt;/strong&gt;
  &lt;%= audio_tag @track.audio.url %&gt;
&lt;/p&gt;
</pre>
</li>

<li><code>[&#xa0;]</code> <a href="./app/views/tracks/index.html.erb">Index</a>

<pre class="example">
&lt;td&gt;&lt;%= audio_tag track.audio.url %&gt;&lt;/td&gt;
</pre>
</li>
</ul>
</div>
</div>
</div>




<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Configure S3</h2>
<div class="outline-text-2" id="text-6">
<p>
<a href="./config/environments/production.rb">production.rb</a>
</p>

<pre class="example">
config.paperclip_defaults = {
  :storage =&gt; :s3,
  :s3_credentials =&gt; {
    :bucket =&gt; ENV['AWS_BUCKET'],
    :access_key_id =&gt; ENV['AWS_ACCESS_KEY_ID'],
    :secret_access_key =&gt; ENV['AWS_SECRET_ACCESS_KEY']
  }
}
</pre>

<ul class="org-ul">
<li><code>[&#xa0;]</code> Create an S3 bucket in AWS

<p>
dailyRecordTracks
</p>

<ul class="org-ul">
<li><code>[&#xa0;]</code> Grant permission to everyone to upate/delete, edit, view
</li>
</ul>
</li>
</ul>
</div>

<div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> Get secret keys from AWS and configure heroku configs</h3>
<div class="outline-text-3" id="text-6-1">
<pre class="example">
heroku config:set AWS_BUCKET=dailyRecordTracks
heroku config:set AWS_ACCESS_KEY_ID=***
heroku config:set AWS_SECRET_ACCESS_KEY=***
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Set up for audio playback</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li><code>[&#xa0;]</code> <a href="https://github.com/tobsch/mediaelement_rails">MediaelementRails</a>

<p>
<a href="./Gemfile">Gemfile</a>
</p>

<pre class="example">
gem 'mediaelement_rails'
bundle install
</pre>

<p>
<a href="./app/assets/javascripts/application.js">application.js</a>
</p>

<pre class="example">
//= require mediaelement_rails
</pre>

<p>
<a href="./app/assets/stylesheets/application.css.scss">./app/assets/stylesheets/application.css.scss</a>
<a href="./app/assets/stylesheets">Stylesheets</a>
</p>

<pre class="example">
*= require mediaelement_rails
</pre>
<p>
and optionally:
</p>
<pre class="example">
*= require mediaelement_rails/mejs-skins
</pre>
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> User/Track associations</h2>
<div class="outline-text-2" id="text-8">
<pre class="example">
rails g migration add_user_id_to_tracks user_id:integer:index
rake db:migrate
</pre>

<p>
<a href="./app/models/track.rb">track.rb</a>
</p>

<pre class="example">
belongs_to :user
</pre>

<p>
<a href="./app/models/user.rb">user.rb</a>
</p>

<pre class="example">
class User &lt; ActiveRecord::Base
  # Include default devise modules. Others available are:
  # :token_authenticatable, :confirmable,
  # :lockable, :timeoutable and :omniauthable
  devise :database_authenticatable, :registerable,
         :recoverable, :rememberable, :trackable, :validatable

  has_many :tracks
end
</pre>
</div>
</div>



<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> Set up Bootstrap</h2>
<div class="outline-text-2" id="text-9">
</div><div id="outline-container-sec-9-1" class="outline-3">
<h3 id="sec-9-1"><span class="section-number-3">9.1</span> Bootstrap-sass</h3>
<div class="outline-text-3" id="text-9-1">
<ul class="org-ul">
<li><code>[&#xa0;]</code> Create custom bootstrap stylesheet

<p>
<a href="./app/assets/stylesheets/bootstrap_and_customization.css.scss">./app/assets/stylesheets/bootstrap_and_customization.css.scss</a>
</p>

<ul class="org-ul">
<li><code>[&#xa0;]</code> create file

<pre class="example">
echo "@import 'bootsrap';" &gt; app/assets/stylesheets/bootstrap_and_customization.css.scss
</pre>
</li>
</ul>
<p>
<b>NOTE</b> Place new variables before "@import 'bootstrap'"
</p>

<ul class="org-ul">
<li><code>[&#xa0;]</code> Fonts

<p>
<i>EXAMPLE:</i>
</p>
<pre class="example">
@import url(http://fonts.googleapis.com/css?family=Roboto:400,100,100italic,700italic,700|Clicker+Script);
</pre>
</li>

<li><code>[&#xa0;]</code> Variables

<pre class="example">
$phill-grn: #3f8000;
</pre>
</li>
</ul>
</li>

<li><code>[&#xa0;]</code> Require Bootstrap's Javascript, after jquery<sub>ujs</sub> 

<p>
<a href="./app/assets/javascripts/application.js">./app/assets/javascripts/application.js</a>
</p>

<pre class="example">
//= require jquery
//= require jquery_ujs
//= require bootstrap
//= require turbolinks
//= require_tree .
</pre>
</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> Configure Views</h2>
<div class="outline-text-2" id="text-10">
</div><div id="outline-container-sec-10-1" class="outline-3">
<h3 id="sec-10-1"><span class="section-number-3">10.1</span> Pages / Songs</h3>
</div>

<div id="outline-container-sec-10-2" class="outline-3">
<h3 id="sec-10-2"><span class="section-number-3">10.2</span> Devise Views</h3>
<div class="outline-text-3" id="text-10-2">
<p>
<a href="./app/views/devise">Devise Views</a>
</p>
</div>
</div>


<div id="outline-container-sec-10-3" class="outline-3">
<h3 id="sec-10-3"><span class="section-number-3">10.3</span> Tracks</h3>
<div class="outline-text-3" id="text-10-3">
<p>
<a href="./app/views/tracks">./app/views/tracks</a>
</p>
</div>
</div>
</div>
</div>
</body>
</html>
